# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
My_data =[10,20,40]
arr =np.array(My_data)
d={"a":10,"b":20,"c":30}

In [3]:
pd.Series(data=My_data)

0    10
1    20
2    40
dtype: int64

In [4]:
pd.Series(data=My_data,index=labels)

a    10
b    20
c    40
dtype: int64

In [5]:
pd.Series(My_data,labels)

a    10
b    20
c    40
dtype: int64

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    40
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [9]:
ser1= pd.Series([1,2,3,4],["Nep","Shr","Ind","Pak"])

In [10]:
ser1

Nep    1
Shr    2
Ind    3
Pak    4
dtype: int64

In [11]:
ser2= pd.Series([1,2,5,4],["Nep","Shr","Ban","Pak"])
ser2

Nep    1
Shr    2
Ban    5
Pak    4
dtype: int64

In [12]:
ser2["Ban"]

5

In [13]:
ser1[3]

4

In [14]:
ser1+ser2

Ban    NaN
Ind    NaN
Nep    2.0
Pak    8.0
Shr    4.0
dtype: float64

# DataFrame

In [15]:
from numpy.random import randn
np.random.seed(101)

In [56]:
df= pd.DataFrame(randn(5,4),["A",'B',"C","D","E"],['w','x','y','z'])

In [57]:
df

          w         x         y         z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [58]:
df['w']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: w, dtype: float64

In [59]:
df[["x","w"]]

          x         w
A  1.693723  0.302665
B  0.390528 -0.134841
C  0.072960  0.807706
D -0.754070 -0.497104
E  1.901755 -0.116773

In [60]:
df.drop("w",axis=1,inplace=True)

In [61]:
df

          x         y         z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

In [62]:
df.drop('E')

          x         y         z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752

In [63]:
df

          x         y         z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

In [64]:
df.shape

(5, 3)

In [65]:
df.loc["A"]

x    1.693723
y   -1.706086
z   -1.159119
Name: A, dtype: float64

In [66]:
df.iloc[2]

x    0.072960
y    0.638787
z    0.329646
Name: C, dtype: float64

In [67]:
df.loc["D",'z']

0.48475164718163294

In [68]:
df.loc[['A','B'],["x","z"]]

          x         z
A  1.693723 -1.159119
B  0.390528  0.184502

In [69]:
booldf=df>0

In [70]:
booldf

       x      y      z
A   True  False  False
B   True   True   True
C   True   True   True
D  False  False   True
E   True   True   True

In [71]:
df[booldf]

          x         y         z
A  1.693723       NaN       NaN
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D       NaN       NaN  0.484752
E  1.901755  0.238127  1.996652

In [72]:
df[df>1]

          x   y         z
A  1.693723 NaN       NaN
B       NaN NaN       NaN
C       NaN NaN       NaN
D       NaN NaN       NaN
E  1.901755 NaN  1.996652

In [81]:
df[df['z']>1][["y",'x']]

          y         x
E  0.238127  1.901755

In [92]:
result=df[(df['z']>1) & (df['x']>1) ]
result

          x         y         z
E  1.901755  0.238127  1.996652

In [87]:
result[['x','y']]

          x         y
E  1.901755  0.238127

In [93]:
df.reset_index()

  index         x         y         z
0     A  1.693723 -1.706086 -1.159119
1     B  0.390528  0.166905  0.184502
2     C  0.072960  0.638787  0.329646
3     D -0.754070 -0.943406  0.484752
4     E  1.901755  0.238127  1.996652

In [94]:
df

          x         y         z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

In [95]:
newId= 'CA NY MU CH KTM'.split()

In [96]:
newId

['CA', 'NY', 'MU', 'CH', 'KTM']

In [147]:
df['City']=newId

In [148]:
df.set_index('City',inplace=True)
df

             x         y         z
City
CA    1.693723 -1.706086 -1.159119
NY    0.390528  0.166905  0.184502
MU    0.072960  0.638787  0.329646
CH   -0.754070 -0.943406  0.484752
KTM   1.901755  0.238127  1.996652

In [157]:
df.iloc[1,1]

0.16690463609281317